# mysql assignment-2

In [5]:
import mysql.connector as conn
mydb=conn.connect(host="localhost",user="root",passwd="anshu@gmail#123")
cursor=mydb.cursor()

import pandas as pd
pd.read_sql("show databases",mydb)

             Database
0     carbon_nanotube
1          cardataset
2            customer
3  information_schema
4               mysql
5                 org
6  performance_schema
7                 sys
8           testanshu

In [6]:
cursor.execute("use org") ## this org table is taken from a website not create dby me.

In [8]:
cursor.execute("show tables")

In [9]:
cursor.fetchall()

[('bonus',), ('title',), ('worker',)]

In [12]:
pd.read_sql("select * from org.worker",mydb)

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

# Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table

In [13]:
cursor.execute("SELECT SUBSTRING(first_name,1,3) from worker")

In [14]:
cursor.fetchall()

[('Mon',),
 ('Nih',),
 ('Vis',),
 ('Ami',),
 ('Viv',),
 ('Vip',),
 ('Sat',),
 ('Gee',)]

# Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [21]:
cursor.execute("select instr(first_name,'a') from worker where first_name='Amitabh'")

In [22]:
cursor.fetchall()

[(1,)]

# Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [43]:
cursor.execute(" select *from worker where salary=(select Max(salary) from worker) ")

In [44]:
cursor.fetchall()

[(4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')]